# Задание 1

name = input(" Ведите имя: ")
surname =input(" Ведите фамилию: ")
year = int(input(" Ведите год рождения: "))

old = str( 2021 - year )


print(name + " " + surname + ", " + old) 



