# Задание 1

name = input(" Ведите имя: ")
surname = input(" Ведите фамилию: ")
year = int(input(" Ведите год рождения: "))

# КОММЕНТАРИЙ: а если бы передавали в print() несколько аргументов, а не использовали конкатенацию строк, то не пришлось бы явно преобразовывать в строку
old = str(2022 - year)

print(name + " " + surname + ", " + old) 


# Слава Гуров, 30

# ДОБАВИТЬ: результат выполнения программы — в закомментированном виде


# ИТОГ: хорошо — 2/3
