min = int(input())

# УДАЛИТЬ: в данной переменной нет необходимости
x = 150

h = min // 60
m = min % 60

# ИСПРАВИТЬ: в этой задаче было необходимо использовать f-строку
# ИСПРАВИТЬ: а здесь у вас к тому же несоответствие требуемому формату вывода из-за огромного количества лишних пробелов
# ИСПРАВИТЬ: в начале строки должно выводиться введённое пользователем количество минут, а не число 150
print(x, " мин ", "-", " это ", h, " ч ", m, " мин ")


# ДОБАВИТЬ: результат выполнения программы — в закомментированном виде


# ИТОГ: переделать — 0/3
