a = int(input())
a1 = a // 100
a2 = a % 100 // 10
a3 = a % 10
print('Сумма цифр =', a1 + a2 + a3)
print('Произведение цифр =', a1 * a2 * a3)

# Сумма цифр = 9
# Произведение цифр = 27


# КОММЕНТАРИЙ: имена a, a1, a2 и a3 не помогают понять, что за значения ассоциированы с этими переменными — а ведь я говорил об этом
# КОММЕНТАРИЙ: мне не нравится, когда мои настоятельные рекомендации, проговорённые в лекции, игнорируются — первый раз обращаю внимание, в дальнейшем буду снижать баллы


# ИТОГ: отлично 4/4
