num = input('Введите первое число: ')
num_1 = input('Введите второе число: ')

if num.isdecimal() and num_1.isdecimal():
    num = int(num)
    num_1 = int(num_1)

    # СДЕЛАТЬ: подумайте и перепишите нижеследующую часть кода так, чтобы обойтись только одной проверкой только одного логического выражения

    # КОММЕНТАРИЙ: скобки не нужны, следует опустить
    if (num % num_1):
        print(f'{num} не делится на {num_1} нацело\n'
              f'неполное частное: {num // num_1}\n'
              # ИСПРАВИТЬ: вы уже вычисляли остаток, а здесь повторно выполняете ту же операцию — неоптимально
              f'остаток: {num % num_1}')
    else:
        print(f'{num} делится на {num_1} нацело\n'
              f'частное: {num // num_1}\n')
else:
    print('Ошибка, ввод')


# Введите первое число: 40
# Введите второе число: 4
# 40 делится на 4 нацело
# частное: 10

# Введите первое число: 40
# Введите второе число: 6
# 40 не делится на 6 нацело
# неполное частное: 6
# остаток: 4


# ИТОГ: хорошо — 2/3
