coor_1 = input('Введите координаты первой клетки: ')
coor_2 = input('Введите координаты второй клетки: ')

if ('a'<= coor_1[0] <= 'h' and '1' <= coor_1[1] <= '8' and
    'a' <= coor_2[0] <= 'h' and '1' <= coor_2[1] <= '8'):
    if coor_1[0] == coor_2[0] or coor_1[1] == coor_2[1]:
        print('да')
    else:
        print('нет')
else:
    print('Ошибка, ввод')
    
# Введите координаты первой клетки: d4
# Введите координаты второй клетки: e4
# да    

# Введите координаты первой клетки: a2
# Введите координаты второй клетки: c4
# нет