coor_1 = input('Введите координаты первой клетки: ')
coor_2 = input('Введите координаты второй клетки: ')

if ('a'<= coor_1[0] <= 'h' and '1' <= coor_1[1] <= '8' and
    'a' <= coor_2[0] <= 'h' and '1' <= coor_2[1] <= '8'):
    if -1 <= ord(coor_1[0]) - ord(coor_2[0]) <= 1 and -1 <= int(coor_1[1]) - int(coor_2[1]) <= 1:
        print('да')
    else:
        print('нет')
else:
    print('Ошибка, ввод')
    
    
# Введите координаты первой клетки: g3
# Введите координаты второй клетки: f2
# да

# Введите координаты первой клетки: c6
# Введите координаты второй клетки: d4
# нет