text = input('Введите текст: ')

char = '--.,:;!?–—\\\'\"()*/'

keys = [''.join(text[i]) for i in range(len(text)) if not text[i] in char ]

print(*keys, sep='')


# Введите текст: Было темно в гостиной. Лаптев, не садясь и держа шляпу в руках, стал извиняться за 
 # беспокойство; он спросил, что делать, чтобы сестра спала по ночам, и отчего она 
 # так страшно худеет, и его смущала мысль, что, кажется, эти самые вопросы он уже 
 # задавал доктору сегодня во время его утреннего визита.
 
 
 
# Было темно в гостиной Лаптев не садясь и держа шляпу в руках 
# стал извиняться за беспокойство он спросил что делать чтобы 
# сестра спала по ночам и отчего она так страшно худеет и его 
# смущала мысль что кажется эти самые вопросы он уже задавал 
# доктору сегодня во время его утреннего визита